insert into answer(answer_id,task_id,answer_name,ans)
values
--Test№1
--task1
(1,1,'Ліворуч і розворот.',false),
(2,1,'Ліворуч.',false),
(3,1,'Прямо, ліворуч і розворот.',true),
(4,1,'Прямо, праворуч, ліворуч і розворот.',false),
--task2
(5,2,'Аварійна сигналізація.',true),
(6,2,'Ближнє світло фар.',false),
(7,2,'Габаритні ліхтарі.',false),
--task3
(8,3,'Неправильно.',false),
(9,3,'Правильно.',true),
--task4
(10,4,'Може в будь-якому випадку.',false),
(11,4,'Може за умови, що обгін буде завершено за 100 м до переїзду.',true),
(12,4,'Не може.',false),
--task5
(13,5,'У місцях, де транспортний засіб унеможливить рух інших транспортних засобів.',false),
(14,5,'У місцях, де транспортний засіб створить перешкоду для руху пішоходів.',false),
(15,5,'На газонах.',false),
(16,5,'Відповіді 1 і 2.',false),
(17,5,'Відповіді 1, 2 і 3.',true),
--task6
(18,6,'Не повинен.',false),
(19,6,'Повинен.',true),
--task7
(20,7,'Інформує про те, що дорога повертає праворуч.',false),
(21,7,'Надає Вам перевагу в разі перестроювання на праву смугу.',false),
(22,7,'Попереджає про наближення до звуження проїзної частини.',true),
--task8
(23,8,'Дозволено.',false),
(24,8,'Заборонено.',true),
--task9
(25,9,'Відстань, що проходить транспортний засіб під час екстреного гальмування з початку впливу на органи керування гальмовою системою до повної зупинки.',true),
(26,9,'Відстань, що проходить транспортний засіб, з місця, де починаються чітко виражені сліди гальмування до повної зупинки.',false),
--task10
(27,10,'З 17:00 до 23:00.',false),
(28,10,'З 19:00 до 24:00.',true),
(29,10,'З 7:00 до 24:00.',false),
--task11
(30,11,'Знак 1.',false),
(31,11,'Знак 2.',false),
(32,11,'Знак 3.',true),
(33,11,'Знак 4.',false),
(34,11,'Знак 5.',false),
--task12
(35,12,'Будь-які елементи дорожніх споруд, які становлять небезпеку.',false),
(36,12,'Тільки вїзд у неосвітлені тунелі.',false),
(37,12,'Тільки нижній край прогонової будови тунелів, мостів і шляхопроводів.',true),
--task13
(38,13,'Ні.',true),
(39,13,'Так, якщо власник пошкодженого майна не має претензій до учасників події.',false),
(40,13,'Так.',false),
(41,13,'Жодне з тверджень не вірне.',false),
--task14
(42,14,'Тільки в разі вчинення дрібного хуліганства.',false),
(43,14,'Тільки в разі порушення Правил дорожнього руху.',false),
(44,14,'Проводиться в разі вчинення правопорушень, зазначених у відповідях 1 і 2 з обов''язковим складанням протоколу про затримання.',true),
--task15
(45,15,'За вїзд на залізничний переїзд у випадках, коли рух через переїзд заборонений.',true),
(46,15,'За керування транспортним засобом, не зареєстрованим або не перереєстрованим в установленому порядку.',false),
(47,15,'За перевищення швидкості більш ніж на 20 км/год.',false),
(48,15,'За порушення вимог дорожніх знаків та розмітки.',false),
--task16
(49,16,'Дати дорогу велосипедисту в будь – якому випадку.',true),
(50,16,'Не повинні давати дорогу велосипедисту, так як велосипедист рухається велосипедною доріжкою.',false),
(51,16,'Посигналити велосипедисту і повернути першим.',false),
--task17
(52,17,'Відносно лінії, що позначає лівий край проїзної частини дороги.',false),
(53,17,'Відносно лінії, що позначає правий край проїзної частини дороги.',true),
(54,17,'Відносно лінії, що розділяє транспортні потоки протилежних напрямків.',false),
--task18
(55,18,'Вжити заходів, які виключають мимовільний рух транспортного засобу.',false),
(56,18,'Через дзеркало заднього виду або поворотом голови назад переконатися в безпеці виходу і потім лише виходити.',false),
(57,18,'У темну пору доби на неосвітленій ділянці дороги (крім житлових зон) ввімкнути габаритні чи стоянкові вогні.',false),
(58,18,'Виконати все, перелічене вище.',true),
--task19
(59,19,'Включити світло фар, як тільки автомобіль, що обганяє, виявився попереду, та рухатися з ввімкненими габаритними вогнями до моменту, поки автомобіль, що рухається попереду, не віддалився на значну відстань.',false),
(60,19,'Відразу переключитися на ближнє світло, як тільки водій наступного за ним автомобіля почав виїжджати на зустрічну смугу руху.',false),
(61,19,'Переключити фари на ближнє світло у момент, коли автомобілі порівнялися, рухаючись по суміжних смугах.',true),
--task20
(62,20,'Вийняти стороннє тіло після чого накласти пов’язку.',false),
(63,20,'Зафіксувати стороннє тіло тільки якщо воно виступає над раною не менше ніж на 5 см.',false),
(64,20,'Накласти пов’язку, не виймаючи стороннього тіла.',true),


--Test№2
--task1
(65,21,'За ними або під прямим кутом до краю проїзної частини в місцях, де дорогу добре видно в обидва боки, і лише після того, як переконаються у відсутності небезпеки.',false),
(66,21,'По них або по лініях тротуарів чи узбіч на перехрестях.',false),
(67,21,'Тільки по них.',true),
--task2
(68,22,'Вимагає від водіїв обовязкової зупинки.',false),
(69,22,'Дозволяє рух й інформує про наявність небезпечного нерегульованого перехрестя.',true),
(70,22,'Забороняє рух транспортних засобів.',false),
--task3
(71,23,'Може.',false),
(72,23,'Не може, оскільки повинен дочекатися ввімкнення зеленого сигналу.',true),
--task4
(73,24,'Жезла або руки, що вказують на цей транспортний засіб.',false),
(74,24,'Увімкненого проблискового маячка синього і червоного або лише червоного кольору або спеціального звукового сигналу.',false),
(75,24,'Гучномовного пристрою.',false),
(76,24,'Спеціального табло, на якому зазначається вимога про зупинку транспортного засобу.',false),
(77,24,'Будь-якого з перелічених вище засобів.',true),
--task5
(78,25,'Водії синього автомобіля і мотоцикла.',false),
(79,25,'Водії фіолетового автомобіля і мотоцикла.',false),
(80,25,'Тільки водій мотоцикла.',false),
(81,25,'Усі водії.',true),
--task6
(82,26,'Місце перехрещення двох вулиць на одному рівні.',false),
(83,26,'В''їзд і виїзд із дворів.',false),
(84,26,'Вїзд і виїзд з автозаправної станції.',false),
(85,26,'Відповіді 1, 2 і 3.',false),
(86,26,'Відповіді 2 і 3.',true),
--task7
(87,27,'Вага транспортного засобу з вантажем, водієм і пасажирами, встановлена технічною характеристикою на даний транспортний засіб підприємством-виробником, яка не повинна перевищувати 3500 кг.',false),
(88,27,'Маса спорядженого транспортного засобу з вантажем, водієм і пасажирами, що встановлена технічною характеристикою транспортного засобу як максимально допустима.',true),
--task8
(89,28,'На обох перехрестях ви взагалі не маєте переваги.',false),
(90,28,'На обох перехрестях.',true),
(91,28,'Тільки на другому перехресті.',false),
(92,28,'Тільки на першому перехресті.',false),
--task9
(93,29,'Заборонено рух транспортних засобів зі швидкістю не меншою, ніж зазначено на знакові.',false),
(94,29,'Заборонено рух транспортних засобів зі швидкістю, що перевищує зазначену на знакові.',true),
(95,29,'Заборонено рух транспортних засобів, довжина яких (з вантажем чи без нього) перевищує зазначену на знакові.',false),
(96,29,'Заборонено рух транспортних засобів, загальна фактична маса яких перевищує зазначену на знакові.',false),
--task10
(97,30,'Дозволяє виконати поворот ліворуч у зазначеному місці.',false),
(98,30,'Дозволяє обїзд перешкоди тільки з лівого боку.',true),
(99,30,'Дозволяє повернути тільки ліворуч.',false),
--task11
(100,31,'Дозволені напрямки руху транспортних засобів по реверсивній смузі.',false),
(101,31,'Дозволені напрямки руху транспортних засобів по смугах на перехресті.',false),
(102,31,'Те, що смуга використовується для руху тільки певних видів транспортних засобів у зазначених напрямках.',true),
--task12
(103,32,'Дозволяє Вам поворот ліворуч і розворот.',true),
(104,32,'Дозволяє Вам тільки поворот ліворуч.',false),
(105,32,'Дозволяє Вам тільки розворот.',false),
--task13
(106,33,'Дозволено.',true),
(107,33,'Заборонено.',false),
--task14
(108,34,'Велосипедисту заборонено повертати наліво в даній ситуації.',false),
(109,34,'Проїде першим.',false),
(110,34,'Проїде, давши дорогу автомобілю.',true),
--task15
(111,35,'Дати дорогу червоному автомобілю.',true),
(112,35,'Проїхати перехрестя першим.',false),
--task16
(113,36,'Зі знаком 1.',false),
(114,36,'Зі знаком 2.',false),
(115,36,'Зі знаком 3.',false),
(116,36,'Зі знаком 4.',true),
(117,36,'Зі знаком 5.',false),
--task17
(118,37,'Будь-хто з водіїв ТЗ — учасників ДТП.',true),
(119,37,'Винуватець ДТП.',false),
(120,37,'Потерпілий в ДТП.',false),
(121,37,'Це вирішують працівники поліції.',false),
--task18
(122,38,'Збільшити швидкість руху, зменшивши дистанцію до транспортного засобу, що рухається попереду Вас.',false),
(123,38,'Попередити наступного ззаду водія різким короткочасним гальмуванням.',false),
(124,38,'Скорегувати швидкість руху, послабивши натискання на педаль газу, щоб збільшити дистанцію до транспортного засобу, що рухається попереду.',true),
(125,38,'Допускається будь-яка з наведених дій.',false),
--task19
(126,39,'Вимкнути двигун і дистанційний вимикач «маси» (при його наявності).',false),
(127,39,'Дістати вогнегасник і підготувати його до використання.',false),
(128,39,'Захистити руки від опіку, надівши рукавички або обернувши пальці ганчірям.',false),
(129,39,'Все перераховане.',true),
--task20
(130,40,'Збільшується.',true),
(131,40,'Зменшується.',false),
(132,40,'Не змінюється.',false);